Classes | Typedefs | Enumerations | Functions
MEP Element Manager
Functions related to the creation, manipulation and management of MEP (Mechanical, Electrical, Plumbing) elements. More...
 Classes
class  | ACAPI::MEP::v1::Accessory
The Accessory is a complex element with two ports on a single axis. More...
class  | ACAPI::MEP::v1::AccessoryDefault
The AccessoryDefault contains the necessary non-geometric data for creating an Accessory element. More...
class  | ACAPI::MEP::v1::AccessoryUIManager
The AccessoryUIManager contains UI-related services for an Accessory. More...
class  | ACAPI::MEP::Adapter::UniqueID
It is a helper class that converts a simple GS::Guid or API_Guid into an MEP::UniqueID. More...
class  | ACAPI::MEP::v1::Bend
The Bend can connect two straight RoutingSegments with the same dimensions but different directions. More...
class  | ACAPI::MEP::v1::BendDefault
The BendDefault contains the necessary non-geometric data for modifying a Bend. More...
class  | ACAPI::MEP::v1::BendUIManager
The BendUIManager contains UI-related services for a Bend. More...
class  | ACAPI::MEP::v1::Branch
A branch is a specific type of fitting that acts as an outlet from a large pipe to a smaller pipe or one of equal size. More...
class  | ACAPI::MEP::v1::BranchDefault
class  | ACAPI::MEP::v1::BranchUIManager
The BranchUIManager contains UI-related services for a Branch. More...
class  | ACAPI::MEP::v1::CableCarrierPort
The CableCarrierPort represents a connection point of a cable carrier. More...
class  | ACAPI::MEP::v1::CableCarrierPortDefault
Through this CableCarrierPortDefault you can access and configure the CableCarrierPorts of MEPElementDefaults before placement. More...
class  | ACAPI::MEP::v1::CableCarrierSegmentPreferenceTable
The CableCarrierSegmentPreferenceTable represents a named entity, that contains rows that consists of a size and a description. The rows have to be unique by value and are always in ascending order. More...
class  | ACAPI::MEP::v1::CableCarrierSegmentPreferenceTableContainer
The CableCarrierSegmentPreferenceTableContainer can contain several PreferenceTableBase associated with cable carriers. More...
class  | ACAPI::MEP::v1::DistributionSystem
A helper object representing a "distribution system", which is a set of MEP elements sharing the same system category index and MEP domain. (E.g. "hot water pipes" or "cold air ducts") More...
class  | ACAPI::MEP::v1::DistributionSystemsGraph
A graph data structure to display MEP distribution systems data. More...
class  | ACAPI::MEP::v1::DistributionSystemsGraphTreeNode
A structural helper class used when iterating through a DistributionSystem in the DistributionSystemsGraph as a tree. More...
class  | ACAPI::MEP::v1::DuctBranchPreferenceTable
The DuctBranchPreferenceTable contains cross section and geometry related information for Duct branches. More...
class  | ACAPI::MEP::v1::DuctBranchPreferenceTableContainer
The DuctBranchPreferenceTableContainer can contain several DuctBranchPreferenceTables. More...
class  | ACAPI::MEP::v1::DuctCircularSegmentPreferenceTable
The DuctCircularSegmentPreferenceTable contains cross section related information for Circular Duct routing segments. More...
class  | ACAPI::MEP::v1::DuctElbowPreferenceTable
The DuctElbowPreferenceTable contains cross section related information for Duct elbows. More...
class  | ACAPI::MEP::v1::DuctElbowPreferenceTableContainer
The DuctElbowPreferenceTableContainer can contain several DuctElbowPreferenceTables. More...
class  | ACAPI::MEP::v1::DuctRectangularSegmentPreferenceTable
The DuctRectangularSegmentPreferenceTable represents a named entity, that contains rows that consists of a size and a description. The rows have to be unique by value and are always in ascending order. More...
class  | ACAPI::MEP::v1::DuctReferenceSet
The DuctReferenceSet contains referenceIds that are used in DuctCircularSegmentPreferenceTable and DuctCircularElbowPreferenceTable. More...
class  | ACAPI::MEP::v1::DuctSegmentPreferenceTableContainer
The DuctSegmentPreferenceTableContainer can contain several PreferenceTableBase associated with ventilation. More...
class  | ACAPI::MEP::v1::Element
The Element represents an instantiable ElementBase. More...
class  | ACAPI::MEP::v1::ElementBase
class  | ACAPI::MEP::v1::ElementDefault
The ElementDefault contains the necessary non-geometric data for creating a MEP element. More...
class  | ACAPI::MEP::v1::ElementUIManager
The ElementUIManager contains UI-related services for an Element. More...
class  | ACAPI::MEP::v1::Equipment
The Equipment is a complex element with more than two ports. More...
class  | ACAPI::MEP::v1::EquipmentDefault
The EquipmentDefault contains the necessary non-geometric data for creating an Equipment element. More...
class  | ACAPI::MEP::v1::EquipmentUIManager
The EquipmentUIManager contains UI-related services for an Equipment . More...
class  | ACAPI::MEP::v1::Fitting
A fitting is used in distribution systems to connect straight sections of pipes and ducts, adapting to different sizes or shapes. More...
class  | ACAPI::MEP::v1::FittingDefault
The FittingDefault contains the necessary non-geometric data for creating a Fitting element. More...
class  | ACAPI::MEP::v1::FittingUIManager
The FittingUIManager contains UI-related services for a Fitting. More...
class  | ACAPI::MEP::v1::FlexibleSegment
In contrast to rigid segments flexible duct is not a connection of multiple elements (straight segments and bends), instead a type of ducting pipe that could easily be bent in different angles. Since Archicad 28 there is a flexible pipe as well for liquids. FlexibleSegment either has a spline geometry defined by control points, or a polyline geometry, which is defined by alternating straight line parts and spline parts. Line parts are defined by their starting and ending coordinates, while spline parts are defined by control points. These alterning segments must start where the previous one ends. Polyline FlexibleSegemnts are only supported in the Piping domain. In the Ventilation domain FlexibleSegments can only be splines. More...
class  | ACAPI::MEP::v1::FlexibleSegmentDefault
The FlexibleSegmentDefault contains the necessary non-geometric data for creating a FlexibleSegment element. More...
class  | ACAPI::MEP::v1::FlexibleSegmentUIManager
The FlexibleSegmentUIManager contains UI-related services for a FlexibleSegment. More...
class  | ACAPI::MEP::v1::ICalculationResultColumn
Formatting for calculated values. More...
class  | ACAPI::MEP::v1::TypedCalculationResultColumn< T >
Template typed version of the ICalculationResultColumn interface. More...
class  | ACAPI::MEP::v1::GraphCalculationInterface
A class to communicate between registered calculating addons and those using the calculations. More...
class  | ACAPI::MEP::v1::ModifiableElement
The Modifiable Element represents an instantiable ModifiableElementBase. More...
class  | ACAPI::MEP::v1::ModifiableElementBase
The ModifiableElementBase contains the available modifying actions for ElementBase. More...
class  | ACAPI::MEP::v1::PipeBranchPreferenceTable
The PipeBranchPreferenceTable contains cross section and geometry related information for Pipe branches. More...
class  | ACAPI::MEP::v1::PipeBranchPreferenceTableContainer
The PipeBranchPreferenceTableContainer can contain several PipeBranchPreferenceTables. More...
class  | ACAPI::MEP::v1::PipeElbowPreferenceTable
The PipeElbowPreferenceTable contains cross section related information for Pipe elbows. More...
class  | ACAPI::MEP::v1::PipeElbowPreferenceTableContainer
The PipeElbowPreferenceTableContainer can contain several PipeElbowPreferenceTables. More...
class  | ACAPI::MEP::v1::PipeReferenceSet
The PipeReferenceSet contains referenceIds that are used in PipeSegmentPreferenceTable and PipeElbowPreferenceTable. More...
class  | ACAPI::MEP::v1::PipeSegmentPreferenceTable
The PipeSegmentPreferenceTable contains cross section related information for Pipe routing segments. More...
class  | ACAPI::MEP::v1::PipeSegmentPreferenceTableContainer
The PipeSegmentPreferenceTableContainer can contain several PreferenceTableBase associated with piping. More...
class  | ACAPI::MEP::v1::PipingPort
The PipingPort represents a connection point of a pipe segment. More...
class  | ACAPI::MEP::v1::PipingPortDefault
Through this PipingPortDefault you can access and configure the PipingPorts of MEPElementDefaults before placement. More...
class  | ACAPI::MEP::v1::Port
The Port represents an instantiable PortBase. Through this object you can reference to the three domain's ports in a common way. More...
class  | ACAPI::MEP::v1::PortBase
The Port is associated to an element and it represents a point between elements. More...
class  | ACAPI::MEP::v1::PortDefaultBase
Through this PortDefault you can access and configure the Ports of MEPElementDefaults before placement. More...
class  | ACAPI::MEP::v1::PreferenceTableContainerBase
The PreferenceTableContainerBase contains PreferenceTables, and you can Add/Get/Delete them. More...
class  | ACAPI::MEP::v1::ReferenceSetBase
The ReferenceSetBase represents a named table, and it contains referenceIds which are used as keys in the PreferenceTables. By default, Archicad will provide you the DN referenceSet, but you can choose your own by renaming it and populate it with your desired values. More...
class  | ACAPI::MEP::v1::RigidSegment
The RigidSegment is placed in RoutingSegments. More...
class  | ACAPI::MEP::v1::RigidSegmentDefault
The RigidSegmentDefault contains the necessary non-geometric data for creating a RigidSegment element. More...
class  | ACAPI::MEP::v1::RigidSegmentUIManager
The RigidSegmentUIManager contains UI-related services for a RigidSegment. More...
class  | ACAPI::MEP::v1::RoutingElement
The RoutingElement can contain Routing Segments and Routing Nodes. More...
class  | ACAPI::MEP::v1::RoutingElementDefault
The RoutingElementDefault contains the necessary non-geometric data for creating a Routing element. More...
class  | ACAPI::MEP::v1::RoutingElementUIManager
The RoutingElementUIManager contains UI-related services for a Routing element. More...
class  | ACAPI::MEP::v1::RoutingNode
The RoutingNode can contain Bend and Transition elements. More...
class  | ACAPI::MEP::v1::RoutingNodeDefault
The RoutingNodeDefault contains the necessary non-geometric data for creating and modifying a Routing Node. More...
class  | ACAPI::MEP::v1::RoutingNodeUIManager
The RoutingNodeUIManager contains UI-related services for a RoutingNode. More...
class  | ACAPI::MEP::v1::RoutingSegment
The RoutingSegment can contain Rigid Segment elements. More...
class  | ACAPI::MEP::v1::RoutingSegmentDefault
The RoutingSegmentDefault contains the necessary non-geometric data for creating and modifying a Routing Segment. More...
class  | ACAPI::MEP::v1::RoutingSegmentUIManager
The RoutingSegmentUIManager contains UI-related services for a RoutingSegment. More...
class  | ACAPI::MEP::v1::TakeOff
The Take-off is a simple element with two ports on a single axis. More...
class  | ACAPI::MEP::v1::TakeOffDefault
The TakeOffDefault contains the necessary non-geometric data for creating a Take-off element. More...
class  | ACAPI::MEP::v1::TakeOffUIManager
The TakeOffUIManager contains UI-related services for an TakeOff. More...
class  | ACAPI::MEP::v1::Terminal
The Terminal is a complex element with a single port. More...
class  | ACAPI::MEP::v1::TerminalDefault
The TerminalDefault contains the necessary non-geometric data for creating a Terminal element. More...
class  | ACAPI::MEP::v1::TerminalUIManager
The TerminalUIManager contains UI-related services for a Terminal. More...
class  | ACAPI::MEP::v1::Transition
The Transition is an element that connects two different Routing Segments. More...
class  | ACAPI::MEP::v1::TransitionDefault
The TransitionDefault contains the necessary non-geometric data for creating and modifying a Transition. More...
class  | ACAPI::MEP::v1::TransitionUIManager
The TransitionUIManager contains UI-related services for a Transition. More...
class  | ACAPI::MEP::UniqueID
The MEP unique identifier. More...
class  | ACAPI::MEP::v1::VentilationPort
The VentilationPort represents a connection point of a duct. More...
class  | ACAPI::MEP::v1::VentilationPortDefault
Through this VentilationPortDefault you can access and configure the VentilationPorts of MEPElementDefaults before placement. More...
struct  | ACAPI::MEP::Orientation
Defines the orientation with the help of a direction and rotation vector. More...
struct  | ACAPI::MEP::RoutingSegmentRectangularCrossSectionData
Defines the necessary data for placing RectangularRoutingSegments of a RoutingElement. More...
struct  | ACAPI::MEP::RoutingSegmentCircularCrossSectionData
Defines the necessary data for placing CircularRoutingSegments of a RoutingElement. More...
struct  | ACAPI::MEP::RouteConnectionResult
Defines the changes regarding Ids after a RoutingElement-RoutingElement connection. More...
struct  | ACAPI::MEP::FlexibleSegmentPolylineLinePart
Defines a single line segment of a polyline FlexibleSegment. More...
struct  | ACAPI::MEP::FlexibleSegmentPolylineSplinePart
Defines a single spline segment of a polyline FlexibleSegment. More...
 Typedefs
 using  | ACAPI::MEP::FlexibleSegmentPolyline = std::vector< std::variant< FlexibleSegmentPolylineLinePart, FlexibleSegmentPolylineSplinePart > >
Defines a polyline FlexibleSegment geometry. Must contain alternating line and spline segments.
 Enumerations
enum class  | ACAPI::MEP::v1::MeasurementSystem { Metric , Imperial }
Measurement systems supported by the Systems Browser. Used for formatting values appropriately to the user's preference. More...
enum class  | ACAPI::MEP::Domain { Ventilation , Piping , CableCarrier }
Type of the domain.
enum class  | ACAPI::MEP::ConnectorShape { Rectangular , Circular , Oval , UShape }
Shape of the connector.
enum class  | ACAPI::MEP::ConnectionStyle { SimpleBody , Flanged , Welded }
Style of the connection.
enum class  | ACAPI::MEP::FlowDirection { FlowNotDefined , FlowIn , FlowOut }
Direction of the flow.
enum class  | ACAPI::MEP::ConnectionSex { Unisex , Male , Female }
Sex of the connection.
enum class  | ACAPI::MEP::PreferredTransitionPlacement { SmallToLarge , LargeToSmall }
Placement type of the preferred transition.
 Functions
Result< AccessoryDefault >  | ACAPI::MEP::v1::CreateAccessoryDefault (Domain domain)
Creates an AccessoryDefault.
Result< AccessoryUIManager >  | ACAPI::MEP::v1::CreateAccessoryUIManager ()
Creates a AccessoryUIManager.
MEPAPI_EXPORT GS::Array< API_Guid >  | ACAPI::MEP::CollectAllMEPElements ()
Returns every MEP element.
MEPAPI_EXPORT GS::UniString  | ACAPI::MEP::GetLocalizedElemTypeName (const API_Guid &typeID)
Returns the localized name of MEP element types.
MEPAPI_EXPORT bool  | ACAPI::MEP::IsBranch (const API_Guid &typeID)
MEPAPI_EXPORT bool  | ACAPI::MEP::IsAccessory (const API_Guid &typeID)
MEPAPI_EXPORT bool  | ACAPI::MEP::IsEquipment (const API_Guid &typeID)
MEPAPI_EXPORT bool  | ACAPI::MEP::IsTerminal (const API_Guid &typeID)
MEPAPI_EXPORT bool  | ACAPI::MEP::IsRoutingElement (const API_Guid &typeID)
MEPAPI_EXPORT bool  | ACAPI::MEP::IsFitting (const API_Guid &typeID)
MEPAPI_EXPORT bool  | ACAPI::MEP::IsRigidSegment (const API_Guid &typeID)
MEPAPI_EXPORT bool  | ACAPI::MEP::IsBend (const API_Guid &typeID)
MEPAPI_EXPORT bool  | ACAPI::MEP::IsTransition (const API_Guid &typeID)
MEPAPI_EXPORT bool  | ACAPI::MEP::IsFlexibleSegment (const API_Guid &typeID)
MEPAPI_EXPORT bool  | ACAPI::MEP::IsTakeOff (const API_Guid &typeID)
MEPAPI_EXPORT bool  | ACAPI::MEP::IsPiping (const API_Guid &typeID)
MEPAPI_EXPORT bool  | ACAPI::MEP::IsCableCarrier (const API_Guid &typeID)
MEPAPI_EXPORT bool  | ACAPI::MEP::IsVentilation (const API_Guid &typeID)
ACAPI::MEP::Adapter::UniqueID::UniqueID (const GS::Guid &guid)
Constructs a UniqueID from GS::Guid.
ACAPI::MEP::Adapter::UniqueID::UniqueID (const API_Guid &guid)
Constructs a UniqueID from API_Guid.
Result< BendDefault >  | ACAPI::MEP::v1::CreateBendDefault (Domain domain)
Creates a BendDefault.
Result< BendUIManager >  | ACAPI::MEP::v1::CreateBendUIManager ()
Creates a BendUIManager.
Result< BranchDefault >  | ACAPI::MEP::v1::CreateBranchDefault (Domain domain)
Creates a BranchDefault.
Result< BranchUIManager >  | ACAPI::MEP::v1::CreateBranchUIManager ()
Creates a BranchUIManager.
Result< CableCarrierSegmentPreferenceTableContainer >  | ACAPI::MEP::v1::GetCableCarrierSegmentPreferenceTableContainer ()
Result< DistributionSystemsGraph >  | ACAPI::MEP::v1::CreateDistributionSystemsGraph ()
Creates a DistributionSystemsGraph.
Result< DuctBranchPreferenceTableContainer >  | ACAPI::MEP::v1::GetDuctBranchPreferenceTableContainer ()
Result< DuctElbowPreferenceTableContainer >  | ACAPI::MEP::v1::GetDuctElbowPreferenceTableContainer ()
Result< DuctReferenceSet >  | ACAPI::MEP::v1::GetDuctReferenceSet ()
Result< DuctSegmentPreferenceTableContainer >  | ACAPI::MEP::v1::GetDuctSegmentPreferenceTableContainer ()
Result< ElementUIManager >  | ACAPI::MEP::v1::CreateElementUIManager ()
Creates a ElementUIManager.
Result< EquipmentDefault >  | ACAPI::MEP::v1::CreateEquipmentDefault ()
Creates an EquipmentDefault.
Result< EquipmentUIManager >  | ACAPI::MEP::v1::CreateEquipmentUIManager ()
Creates a EquipmentUIManager.
Result< FittingDefault >  | ACAPI::MEP::v1::CreateFittingDefault (Domain domain)
Creates an FittingDefault.
Result< FittingUIManager >  | ACAPI::MEP::v1::CreateFittingUIManager ()
Creates a FittingUIManager.
Result< FlexibleSegmentDefault >  | ACAPI::MEP::v1::CreateFlexibleSegmentDefault (Domain domain)
Creates a FlexibleSegmentDefault.
Result< FlexibleSegmentUIManager >  | ACAPI::MEP::v1::CreateFlexibleSegmentUIManager ()
Creates a FlexibleSegmentUIManager.
Result< GraphCalculationInterface >  | ACAPI::MEP::v1::CreateCalculationInterface ()
Creates an instance of the GraphCalculationInterface.
Result< PipeBranchPreferenceTableContainer >  | ACAPI::MEP::v1::GetPipeBranchPreferenceTableContainer ()
Result< PipeElbowPreferenceTableContainer >  | ACAPI::MEP::v1::GetPipeElbowPreferenceTableContainer ()
Result< PipeReferenceSet >  | ACAPI::MEP::v1::GetPipeReferenceSet ()
Result< PipeSegmentPreferenceTableContainer >  | ACAPI::MEP::v1::GetPipeSegmentPreferenceTableContainer ()
Result< RigidSegmentDefault >  | ACAPI::MEP::v1::CreateRigidSegmentDefault (Domain domain)
Creates a RigidSegmentDefault.
Result< RigidSegmentUIManager >  | ACAPI::MEP::v1::CreateRigidSegmentUIManager ()
Creates a RigidSegmentUIManager.
Result< RoutingElementDefault >  | ACAPI::MEP::v1::CreateRoutingElementDefault (Domain domain)
Creates a RoutingElementDefault.
Result< RoutingElementUIManager >  | ACAPI::MEP::v1::CreateRoutingElementUIManager ()
Creates a RoutingElementUIManager.
Result< RoutingNodeDefault >  | ACAPI::MEP::v1::CreateRoutingNodeDefault (Domain domain)
Creates a RoutingNodeDefault.
Result< RoutingNodeUIManager >  | ACAPI::MEP::v1::CreateRoutingNodeUIManager ()
Creates a RoutingNodeUIManager.
Result< RoutingSegmentDefault >  | ACAPI::MEP::v1::CreateRoutingSegmentDefault (Domain domain)
Creates a RoutingSegmentDefault.
Result< RoutingSegmentUIManager >  | ACAPI::MEP::v1::CreateRoutingSegmentUIManager ()
Creates a RoutingSegmentUIManager.
Result< TakeOffDefault >  | ACAPI::MEP::v1::CreateTakeOffDefault (Domain domain)
Creates a TakeOffDefault.
Result< TakeOffUIManager >  | ACAPI::MEP::v1::CreateTakeOffUIManager ()
Creates a TakeOffUIManager.
Result< TerminalDefault >  | ACAPI::MEP::v1::CreateTerminalDefault (Domain domain)
Creates a TerminalDefault.
Result< TerminalUIManager >  | ACAPI::MEP::v1::CreateTerminalUIManager ()
Creates a TerminalUIManager.
Result< TransitionDefault >  | ACAPI::MEP::v1::CreateTransitionDefault (Domain domain)
Creates a TransitionDefault.
Result< TransitionUIManager >  | ACAPI::MEP::v1::CreateTransitionUIManager ()
Creates a TransitionUIManager.
ACAPI::MEP::UniqueID::UniqueID (const GS::Guid &, const API_Token &)
Constructs a UniqueID.
Detailed Description
Functions related to the creation, manipulation and management of MEP (Mechanical, Electrical, Plumbing) elements.
Enumeration Type Documentation
◆ MeasurementSystem
 enum class ACAPI::MEP::v1::MeasurementSystem
strong
Measurement systems supported by the Systems Browser. Used for formatting values appropriately to the user's preference.
Since
Archicad 28
Function Documentation
◆ CollectAllMEPElements()
 MEPAPI_EXPORT GS::Array< API_Guid > ACAPI::MEP::CollectAllMEPElements  |  ( |   | )
Returns every MEP element.
Since
Archicad 28
Returns
Gives back every MEP element's GUID in an array
◆ CreateAccessoryDefault()
 Result< AccessoryDefault > ACAPI::MEP::v1::CreateAccessoryDefault  |  ( |  Domain  |  domain | )
inline
Creates an AccessoryDefault.
Parameters
domain | The Domain of the requested AccessoryDefault. It can be ventilation or piping.
Returns
If able, returns a copy of Archicad's current Default of the Accessory tool for the domain defined by the parameter, otherwise Error (for ex. if domain is cable carrier).
◆ CreateAccessoryUIManager()
 Result< AccessoryUIManager > ACAPI::MEP::v1::CreateAccessoryUIManager  |  ( |   | )
inline
Creates a AccessoryUIManager.
Returns
If able, creates a new manager for Accessory, otherwise Error.
◆ CreateBendDefault()
 Result< BendDefault > ACAPI::MEP::v1::CreateBendDefault  |  ( |  Domain  |  domain | )
inline
Creates a BendDefault.
Parameters
domain | The Domain of the requested BendDefault.
Returns
If able, returns a copy of Archicad's current Default of the Bend from the RoutingElement tool for the domain defined by the parameter, otherwise Error.
◆ CreateBendUIManager()
 Result< BendUIManager > ACAPI::MEP::v1::CreateBendUIManager  |  ( |   | )
inline
Creates a BendUIManager.
Returns
If able, creates a new manager for Bend, otherwise Error.
◆ CreateBranchDefault()
 Result< BranchDefault > ACAPI::MEP::v1::CreateBranchDefault  |  ( |  Domain  |  domain | )
inline
Creates a BranchDefault.
After creating and customizing a BranchDefault, it needs to be set as Archicad's default in order to use it during the upcoming RoutingElement connections.
Parameters
domain | The Domain of the requested BranchDefault.
Returns
If able, returns a copy of Archicad's current Default of the Branch tool for the domain defined by the parameter, otherwise Error
◆ CreateBranchUIManager()
 Result< BranchUIManager > ACAPI::MEP::v1::CreateBranchUIManager  |  ( |   | )
inline
Creates a BranchUIManager.
Returns
If able, creates a new manager for Branch, otherwise Error.
◆ CreateCalculationInterface()
 Result< GraphCalculationInterface > ACAPI::MEP::v1::CreateCalculationInterface  |  ( |   | )
inline
Creates an instance of the GraphCalculationInterface.
      This function is used to get the singleton instance of the GraphCalculationInterface.
      It is a friend function of the GraphCalculationInterface class, allowing it to access
      the private members of the class.
Returns
A reference to the GraphCalculationInterface instance.
 ACAPI::Result<ACAPI::MEP::GraphCalculationInterface> calculationInterface = ACAPI::MEP::CreateCalculationInterface ();
 if (calculationInterface.IsErr ())
 return calculationInterface.UnwrapErr ().kind;
◆ CreateDistributionSystemsGraph()
 Result< DistributionSystemsGraph > ACAPI::MEP::v1::CreateDistributionSystemsGraph  |  ( |   | )
inline
Creates a DistributionSystemsGraph.
Returns
If able, creates a new DistributionSystemsGraph, otherwise Error.
 auto newGraph = ACAPI::MEP::CreateDistributionSystemsGraph ();
 if (newGraph.IsErr ())
 return APIERR_COMMANDFAILED;
◆ CreateElementUIManager()
 Result< ElementUIManager > ACAPI::MEP::v1::CreateElementUIManager  |  ( |   | )
inline
Creates a ElementUIManager.
Returns
If able, creates a new manager for Element, otherwise Error.
◆ CreateEquipmentDefault()
 Result< EquipmentDefault > ACAPI::MEP::v1::CreateEquipmentDefault  |  ( |   | )
inline
Creates an EquipmentDefault.
Returns
If able, returns a copy of Archicad's current Default of the Equipment tool, otherwise Error.
◆ CreateEquipmentUIManager()
 Result< EquipmentUIManager > ACAPI::MEP::v1::CreateEquipmentUIManager  |  ( |   | )
inline
Creates a EquipmentUIManager.
Returns
If able, creates a new manager for Equipment, otherwise Error.
◆ CreateFittingDefault()
 Result< FittingDefault > ACAPI::MEP::v1::CreateFittingDefault  |  ( |  Domain  |  domain | )
inline
Creates an FittingDefault.
Parameters
domain | The Domain of the requested FittingDefault.
Returns
If able, returns a copy of Archicad's current Default of the Fitting tool for the domain defined by the parameter, otherwise Error.
◆ CreateFittingUIManager()
 Result< FittingUIManager > ACAPI::MEP::v1::CreateFittingUIManager  |  ( |   | )
inline
Creates a FittingUIManager.
Returns
If able, creates a new manager for Fitting, otherwise Error.
◆ CreateFlexibleSegmentDefault()
 Result< FlexibleSegmentDefault > ACAPI::MEP::v1::CreateFlexibleSegmentDefault  |  ( |  Domain  |  domain | )
inline
Creates a FlexibleSegmentDefault.
Parameters
domain | The domain determines whether the Default will be Duct or Pipe FlexibleSegment tool.
Returns
If able, returns a copy of Archicad's current Default of the Duct (Ventilation) or Pipe (Piping) FlexibleSegment tool, otherwise Error.
◆ CreateFlexibleSegmentUIManager()
 Result< FlexibleSegmentUIManager > ACAPI::MEP::v1::CreateFlexibleSegmentUIManager  |  ( |   | )
inline
Creates a FlexibleSegmentUIManager.
Returns
If able, creates a new manager for FlexibleSegment, otherwise Error.
◆ CreateRigidSegmentDefault()
 Result< RigidSegmentDefault > ACAPI::MEP::v1::CreateRigidSegmentDefault  |  ( |  Domain  |  domain | )
inline
Creates a RigidSegmentDefault.
Parameters
domain | The Domain of the requested RigidSegmentDefault.
Returns
If able, returns a copy of Archicad's current Default of the RigidSegment from the RoutingElement tool for the domain defined by the parameter, otherwise Error.
◆ CreateRigidSegmentUIManager()
 Result< RigidSegmentUIManager > ACAPI::MEP::v1::CreateRigidSegmentUIManager  |  ( |   | )
inline
Creates a RigidSegmentUIManager.
Returns
If able, creates a new manager for RigidSegment, otherwise Error.
◆ CreateRoutingElementDefault()
 Result< RoutingElementDefault > ACAPI::MEP::v1::CreateRoutingElementDefault  |  ( |  Domain  |  domain | )
inline
Creates a RoutingElementDefault.
Parameters
domain | The Domain of the requested RoutingElementDefault.
Returns
If able, returns a copy of Archicad's current Default of the RoutingElement tool for the domain defined by the parameter, otherwise Error.
◆ CreateRoutingElementUIManager()
 Result< RoutingElementUIManager > ACAPI::MEP::v1::CreateRoutingElementUIManager  |  ( |   | )
inline
Creates a RoutingElementUIManager.
Returns
If able, creates a new manager for RoutingElement, otherwise Error.
◆ CreateRoutingNodeDefault()
 Result< RoutingNodeDefault > ACAPI::MEP::v1::CreateRoutingNodeDefault  |  ( |  Domain  |  domain | )
inline
Creates a RoutingNodeDefault.
Parameters
domain | The Domain of the requested RoutingNodeDefault.
Returns
If able, returns a copy of Archicad's current Default of the RoutingNode from the RoutingElement tool for the domain defined by the parameter, otherwise Error.
◆ CreateRoutingNodeUIManager()
 Result< RoutingNodeUIManager > ACAPI::MEP::v1::CreateRoutingNodeUIManager  |  ( |   | )
inline
Creates a RoutingNodeUIManager.
Returns
If able, creates a new manager for RoutingNode, otherwise Error.
◆ CreateRoutingSegmentDefault()
 Result< RoutingSegmentDefault > ACAPI::MEP::v1::CreateRoutingSegmentDefault  |  ( |  Domain  |  domain | )
inline
Creates a RoutingSegmentDefault.
Parameters
domain | The Domain of the requested RoutingSegmentDefault.
Returns
If able, returns a copy of Archicad's current Default of the RoutingSegment from the RoutingElement tool for the domain defined by the parameter, otherwise Error.
◆ CreateRoutingSegmentUIManager()
 Result< RoutingSegmentUIManager > ACAPI::MEP::v1::CreateRoutingSegmentUIManager  |  ( |   | )
inline
Creates a RoutingSegmentUIManager.
Returns
If able, creates a new manager for RoutingSegment, otherwise Error.
◆ CreateTakeOffDefault()
 Result< TakeOffDefault > ACAPI::MEP::v1::CreateTakeOffDefault  |  ( |  Domain  |  domain | )
inline
Creates a TakeOffDefault.
Parameters
domain | The domain of the requested TakeOffDefault. Currently it can only be ventilation.
Returns
If able, returns a copy of Archicad's current Default of the TakeOff tool for the domain defined by the parameter, otherwise Error (for ex. if domain is cable carrier).
◆ CreateTakeOffUIManager()
 Result< TakeOffUIManager > ACAPI::MEP::v1::CreateTakeOffUIManager  |  ( |   | )
inline
Creates a TakeOffUIManager.
Returns
If able, creates a new manager for TakeOff, otherwise Error.
◆ CreateTerminalDefault()
 Result< TerminalDefault > ACAPI::MEP::v1::CreateTerminalDefault  |  ( |  Domain  |  domain | )
inline
Creates a TerminalDefault.
Parameters
domain | The Domain of the requested TerminalDefault. It can be ventilation or piping.
Returns
If able, returns a copy of Archicad's current Default of the Terminal tool for the domain defined by the parameter, otherwise Error (for ex. if domain is cable carrier).
◆ CreateTerminalUIManager()
 Result< TerminalUIManager > ACAPI::MEP::v1::CreateTerminalUIManager  |  ( |   | )
inline
Creates a TerminalUIManager.
Returns
If able, creates a new manager for Terminal, otherwise Error.
◆ CreateTransitionDefault()
 Result< TransitionDefault > ACAPI::MEP::v1::CreateTransitionDefault  |  ( |  Domain  |  domain | )
inline
Creates a TransitionDefault.
Parameters
domain | The Domain of the requested TransitionDefault.
Returns
If able, returns a copy of Archicad's current Default of the Transition from the RoutingElement tool for the domain defined by the parameter, otherwise Error.
◆ CreateTransitionUIManager()
 Result< TransitionUIManager > ACAPI::MEP::v1::CreateTransitionUIManager  |  ( |   | )
inline
Creates a TransitionUIManager.
Returns
If able, creates a new manager for Transitions, otherwise Error.
◆ GetCableCarrierSegmentPreferenceTableContainer()
 Result< CableCarrierSegmentPreferenceTableContainer > ACAPI::MEP::v1::GetCableCarrierSegmentPreferenceTableContainer  |  ( |   | )
inline
Returns
If able, returns the CableCarrierPreferenceTableContainer from the project.
◆ GetDuctBranchPreferenceTableContainer()
 Result< DuctBranchPreferenceTableContainer > ACAPI::MEP::v1::GetDuctBranchPreferenceTableContainer  |  ( |   | )
inline
Returns
If able, returns the DuctBranchPreferenceTableContainer from the project.
◆ GetDuctElbowPreferenceTableContainer()
 Result< DuctElbowPreferenceTableContainer > ACAPI::MEP::v1::GetDuctElbowPreferenceTableContainer  |  ( |   | )
inline
Returns
If able, returns the DuctElbowPreferenceTableContainer from the project.
◆ GetDuctReferenceSet()
 Result< DuctReferenceSet > ACAPI::MEP::v1::GetDuctReferenceSet  |  ( |   | )
inline
Returns
If able, returns the DuctReferenceSet from the project.
◆ GetDuctSegmentPreferenceTableContainer()
 Result< DuctSegmentPreferenceTableContainer > ACAPI::MEP::v1::GetDuctSegmentPreferenceTableContainer  |  ( |   | )
inline
Returns
If able, returns the DuctPreferenceTableContainer from the project.
◆ GetLocalizedElemTypeName()
 MEPAPI_EXPORT GS::UniString ACAPI::MEP::GetLocalizedElemTypeName  |  ( |  const API_Guid &  |  typeID | )
Returns the localized name of MEP element types.
Since
Archicad 26
Parameters
typeID | The guid of the element type
Returns
If the typeID belongs to an MEP element, it returns its name, otherwise an empty string.
◆ GetPipeBranchPreferenceTableContainer()
 Result< PipeBranchPreferenceTableContainer > ACAPI::MEP::v1::GetPipeBranchPreferenceTableContainer  |  ( |   | )
inline
Returns
If able, returns the PipeBranchPreferenceTableContainer from the project.
◆ GetPipeElbowPreferenceTableContainer()
 Result< PipeElbowPreferenceTableContainer > ACAPI::MEP::v1::GetPipeElbowPreferenceTableContainer  |  ( |   | )
inline
Returns
If able, returns the PipeElbowPreferenceTableContainer from the project.
◆ GetPipeReferenceSet()
 Result< PipeReferenceSet > ACAPI::MEP::v1::GetPipeReferenceSet  |  ( |   | )
inline
Returns
If able, returns the PipeReferenceSet from the project.
◆ GetPipeSegmentPreferenceTableContainer()
 Result< PipeSegmentPreferenceTableContainer > ACAPI::MEP::v1::GetPipeSegmentPreferenceTableContainer  |  ( |   | )
inline
Returns
If able, returns the PipePreferenceTableContainer from the project.
◆ IsAccessory()
 MEPAPI_EXPORT bool ACAPI::MEP::IsAccessory  |  ( |  const API_Guid &  |  typeID | )
Parameters
typeID | The guid of the element type
Since
Archicad 26
Returns
Decides if the typeID belongs to an Accessory
◆ IsBend()
 MEPAPI_EXPORT bool ACAPI::MEP::IsBend  |  ( |  const API_Guid &  |  typeID | )
Parameters
typeID | The guid of the element type
Returns
Decides if the typeID belongs to a Bend
◆ IsBranch()
 MEPAPI_EXPORT bool ACAPI::MEP::IsBranch  |  ( |  const API_Guid &  |  typeID | )
Parameters
typeID | The guid of the element type
Since
Archicad 26
Returns
Decides if the typeID belongs to a Branch
◆ IsCableCarrier()
 MEPAPI_EXPORT bool ACAPI::MEP::IsCableCarrier  |  ( |  const API_Guid &  |  typeID | )
Parameters
typeID | The guid of the element type
Since
Archicad 28
Returns
Decides if the typeID belongs to a Cable carrier
◆ IsEquipment()
 MEPAPI_EXPORT bool ACAPI::MEP::IsEquipment  |  ( |  const API_Guid &  |  typeID | )
Parameters
typeID | The guid of the element type
Since
Archicad 26
Returns
Decides if the typeID belongs to an Equipment
◆ IsFitting()
 MEPAPI_EXPORT bool ACAPI::MEP::IsFitting  |  ( |  const API_Guid &  |  typeID | )
Parameters
typeID | The guid of the element type
Since
Archicad 26
Returns
Decides if the typeID belongs to a Fitting
◆ IsFlexibleSegment()
 MEPAPI_EXPORT bool ACAPI::MEP::IsFlexibleSegment  |  ( |  const API_Guid &  |  typeID | )
Parameters
typeID | The guid of the element type
Returns
Decides if the typeID belongs to a FlexibleSegment
◆ IsPiping()
 MEPAPI_EXPORT bool ACAPI::MEP::IsPiping  |  ( |  const API_Guid &  |  typeID | )
Parameters
typeID | The guid of the element type
Since
Archicad 28
Returns
Decides if the typeID belongs to a Piping
◆ IsRigidSegment()
 MEPAPI_EXPORT bool ACAPI::MEP::IsRigidSegment  |  ( |  const API_Guid &  |  typeID | )
Parameters
typeID | The guid of the element type
Since
Archicad 26
Returns
Decides if the typeID belongs to a RigidSegment
◆ IsRoutingElement()
 MEPAPI_EXPORT bool ACAPI::MEP::IsRoutingElement  |  ( |  const API_Guid &  |  typeID | )
Parameters
typeID | The guid of the element type
Since
Archicad 26
Returns
Decides if the typeID belongs to a RoutingElement
◆ IsTakeOff()
 MEPAPI_EXPORT bool ACAPI::MEP::IsTakeOff  |  ( |  const API_Guid &  |  typeID | )
Parameters
typeID | The guid of the element type
Since
Archicad 28
Returns
Decides if the typeID belongs to a Take-off
◆ IsTerminal()
 MEPAPI_EXPORT bool ACAPI::MEP::IsTerminal  |  ( |  const API_Guid &  |  typeID | )
Parameters
typeID | The guid of the element type
Since
Archicad 26
Returns
Decides if the typeID belongs to a Terminal
◆ IsTransition()
 MEPAPI_EXPORT bool ACAPI::MEP::IsTransition  |  ( |  const API_Guid &  |  typeID | )
Parameters
typeID | The guid of the element type
Returns
Decides if the typeID belongs to a Transition
◆ IsVentilation()
 MEPAPI_EXPORT bool ACAPI::MEP::IsVentilation  |  ( |  const API_Guid &  |  typeID | )
Parameters
typeID | The guid of the element type
Since
Archicad 28
Returns
Decides if the typeID belongs to a Ventilation
◆ UniqueID() [1/2]
 ACAPI::MEP::Adapter::UniqueID::UniqueID  |  ( |  const API_Guid &  |  guid | )
inline
Constructs a UniqueID from API_Guid.
Parameters
guid | The GUID to convert.
◆ UniqueID() [2/2]
 ACAPI::MEP::Adapter::UniqueID::UniqueID  |  ( |  const GS::Guid &  |  guid | )
inline
Constructs a UniqueID from GS::Guid.
Parameters
guid | The GUID to convert.